http-benchmarks/output/run-httpserv_lwt-50000-1000.txt
Running 1m test @ http://localhost:8080
  24 threads and 1000 connections
  Thread calibration: mean lat.: 1731.633ms, rate sampling interval: 6332ms
  Thread calibration: mean lat.: 1713.705ms, rate sampling interval: 6381ms
  Thread calibration: mean lat.: 1733.845ms, rate sampling interval: 6361ms
  Thread calibration: mean lat.: 1716.525ms, rate sampling interval: 6332ms
  Thread calibration: mean lat.: 1773.969ms, rate sampling interval: 6516ms
  Thread calibration: mean lat.: 1740.417ms, rate sampling interval: 6397ms
  Thread calibration: mean lat.: 1750.991ms, rate sampling interval: 6402ms
  Thread calibration: mean lat.: 1750.202ms, rate sampling interval: 6447ms
  Thread calibration: mean lat.: 1805.894ms, rate sampling interval: 6615ms
  Thread calibration: mean lat.: 1769.039ms, rate sampling interval: 6500ms
  Thread calibration: mean lat.: 1807.531ms, rate sampling interval: 6594ms
  Thread calibration: mean lat.: 1694.834ms, rate sampling interval: 6238ms
  Thread calibration: mean lat.: 1721.768ms, rate sampling interval: 6365ms
  Thread calibration: mean lat.: 1600.158ms, rate sampling interval: 5836ms
  Thread calibration: mean lat.: 1717.717ms, rate sampling interval: 6103ms
  Thread calibration: mean lat.: 1777.533ms, rate sampling interval: 6459ms
  Thread calibration: mean lat.: 1764.073ms, rate sampling interval: 6463ms
  Thread calibration: mean lat.: 1751.190ms, rate sampling interval: 6369ms
  Thread calibration: mean lat.: 1756.218ms, rate sampling interval: 6438ms
  Thread calibration: mean lat.: 1716.837ms, rate sampling interval: 6287ms
  Thread calibration: mean lat.: 1706.713ms, rate sampling interval: 6234ms
  Thread calibration: mean lat.: 1729.408ms, rate sampling interval: 6291ms
  Thread calibration: mean lat.: 1690.831ms, rate sampling interval: 6217ms
  Thread calibration: mean lat.: 1670.111ms, rate sampling interval: 6029ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.30s     5.12s   22.71s    58.43%
    Req/Sec     1.35k    19.08     1.43k    79.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.27s 
 75.000%   16.65s 
 90.000%   19.35s 
 99.000%   21.58s 
 99.900%   22.18s 
 99.990%   22.45s 
 99.999%   22.64s 
100.000%   22.72s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2705.407     0.000000            1         1.00
    5255.167     0.100000       161211         1.11
    7000.063     0.200000       322410         1.25
    8749.055     0.300000       483282         1.43
   10502.143     0.400000       644402         1.67
   12271.615     0.500000       805506         2.00
   13148.159     0.550000       885806         2.22
   14024.703     0.600000       966477         2.50
   14901.247     0.650000      1047176         2.86
   15777.791     0.700000      1127568         3.33
   16654.335     0.750000      1207906         4.00
   17104.895     0.775000      1249447         4.44
   17530.879     0.800000      1288579         5.00
   17973.247     0.825000      1328959         5.71
   18415.615     0.850000      1369062         6.67
   18874.367     0.875000      1409641         8.00
   19103.743     0.887500      1429255         8.89
   19349.503     0.900000      1449955        10.00
   19595.263     0.912500      1470144        11.43
   19841.023     0.925000      1489570        13.33
   20119.551     0.937500      1510661        16.00
   20250.623     0.943750      1519989        17.78
   20398.079     0.950000      1530192        20.00
   20545.535     0.956250      1540064        22.86
   20709.375     0.962500      1550560        26.67
   20873.215     0.968750      1560458        32.00
   20955.135     0.971875      1565121        35.56
   21053.439     0.975000      1570513        40.00
   21151.743     0.978125      1575715        45.71
   21250.047     0.981250      1580615        53.33
   21348.351     0.984375      1585104        64.00
   21413.887     0.985938      1587937        71.11
   21479.423     0.987500      1590597        80.00
   21544.959     0.989062      1593129        91.43
   21610.495     0.990625      1595476       106.67
   21692.415     0.992188      1598173       128.00
   21725.183     0.992969      1599149       142.22
   21774.335     0.993750      1600592       160.00
   21807.103     0.994531      1601510       182.86
   21856.255     0.995313      1602804       213.33
   21905.407     0.996094      1604020       256.00
   21938.175     0.996484      1604775       284.44
   21970.943     0.996875      1605444       320.00
   22003.711     0.997266      1606086       365.71
   22036.479     0.997656      1606651       426.67
   22069.247     0.998047      1607178       512.00
   22102.015     0.998242      1607647       568.89
   22118.399     0.998437      1607865       640.00
   22134.783     0.998633      1608075       731.43
   22167.551     0.998828      1608472       853.33
   22200.319     0.999023      1608828      1024.00
   22216.703     0.999121      1608976      1137.78
   22233.087     0.999219      1609120      1280.00
   22249.471     0.999316      1609251      1462.86
   22265.855     0.999414      1609373      1706.67
   22282.239     0.999512      1609485      2048.00
   22298.623     0.999561      1609585      2275.56
   22315.007     0.999609      1609682      2560.00
   22331.391     0.999658      1609756      2925.71
   22347.775     0.999707      1609833      3413.33
   22364.159     0.999756      1609891      4096.00
   22380.543     0.999780      1609939      4551.11
   22396.927     0.999805      1609980      5120.00
   22413.311     0.999829      1610023      5851.43
   22429.695     0.999854      1610064      6826.67
   22429.695     0.999878      1610064      8192.00
   22446.079     0.999890      1610104      9102.22
   22446.079     0.999902      1610104     10240.00
   22462.463     0.999915      1610127     11702.86
   22478.847     0.999927      1610150     13653.33
   22495.231     0.999939      1610172     16384.00
   22495.231     0.999945      1610172     18204.44
   22511.615     0.999951      1610188     20480.00
   22527.999     0.999957      1610201     23405.71
   22527.999     0.999963      1610201     27306.67
   22560.767     0.999969      1610214     32768.00
   22577.151     0.999973      1610224     36408.89
   22577.151     0.999976      1610224     40960.00
   22593.535     0.999979      1610231     46811.43
   22593.535     0.999982      1610231     54613.33
   22609.919     0.999985      1610238     65536.00
   22609.919     0.999986      1610238     72817.78
   22626.303     0.999988      1610241     81920.00
   22642.687     0.999989      1610245     93622.86
   22642.687     0.999991      1610245    109226.67
   22659.071     0.999992      1610249    131072.00
   22659.071     0.999993      1610249    145635.56
   22675.455     0.999994      1610254    163840.00
   22675.455     0.999995      1610254    187245.71
   22675.455     0.999995      1610254    218453.33
   22675.455     0.999996      1610254    262144.00
   22675.455     0.999997      1610254    291271.11
   22691.839     0.999997      1610256    327680.00
   22691.839     0.999997      1610256    374491.43
   22691.839     0.999998      1610256    436906.67
   22691.839     0.999998      1610256    524288.00
   22708.223     0.999998      1610257    582542.22
   22708.223     0.999998      1610257    655360.00
   22708.223     0.999999      1610257    748982.86
   22724.607     0.999999      1610259    873813.33
   22724.607     1.000000      1610259          inf
#[Mean    =    12295.592, StdDeviation   =     5122.915]
#[Max     =    22708.224, Total count    =      1610259]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1935957 requests in 1.00m, 3.95GB read
Requests/sec:  32267.70
Transfer/sec:     67.39MB

JSON Output:
{
	"requests": 1935957,
	"duration_in_microseconds": 59996741.00,
	"bytes": 4239745830,
	"requests_per_sec": 32267.70,
	"bytes_transfer_per_sec": 70666268.86,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 12271615
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 16654335
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 19349503
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 21577727
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 22183935
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 22446079
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 22642687
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 22724607
		}
	]
}